app/Http/Controllers/Tramites/ArchivadorController.php

        //          break;
        //  }

        $archivador = Archivador::select([
            'idarch',
            'arch_periodo',
            'arch_nombre',
        ])
            ->where('arch_iddependencia', '=', Auth::user()->depe_id)
            ->orderBy('arch_periodo', 'desc')
            ->orderBy('arch_nombre', 'asc')
            ->groupBy('idarch')
            ->groupBy('arch_nombre')
            ->groupBy('arch_periodo')
            ->get();
---
select "idarch", "arch_periodo", "arch_nombre" from "tram_archivador" where "arch_iddependencia" = 2 group by "idarch", "arch_nombre", "arch_periodo" order by "arch_periodo" desc, "arch_nombre" asc