app/Http/Controllers/Tramites/DocumentoController.php

    public function buscarDocumento(Request $request)
    {
        $documento = Tram_documento::select(
            [
                'iddocumento',
                'docu_idexma as expediente',
                'docu_origen',
                'docu_tipo',
                'tdo.tdoc_descripcion',
                'docu_numero_doc',
                'docu_siglas_doc',
                'docu_fecha_doc',
                'docu_folios',
                'docu_asunto',
                'docu_iddependencia',
                'td.depe_nombre as unidad',
                'td2.depe_nombre as dependencia',
                'docu_firma',
                'docu_cargo',
                'docu_domic',
                'docu_ruc',
                'docu_dni',
                'docu_idtipodocumento',
                'docu_idusuario',
                'docu_proyectado',
                'docu_emailorigen',
                'docu_telef',
            ])
            ->join('tram_tipodocumento as tdo', 'docu_idtipodocumento', '=', 'tdo.idtdoc')
            ->join('admin as a', 'docu_idusuario', '=', 'a.id')
            ->join('tram_dependencia as td', 'docu_iddependencia', '=', 'td.iddependencia')
            ->leftJoin('tram_dependencia as td2', 'td.depe_depende', '=', 'td2.iddependencia')
            ->where('iddocumento', $request->iddocumento)
            ->first();
        if ($request->only_document)
            return $documento;
        $relacionados = Tram_documento::select(
            [
                'iddocumento',
                'tdo.tdoc_descripcion',
                'docu_numero_doc',
                'docu_siglas_doc',
                'docu_asunto',
                'docu_archivo',
            ])
            ->join('tram_tipodocumento as tdo', 'docu_idtipodocumento', '=', 'tdo.idtdoc')
            ->join('tram_operacion', 'oper_iddocumento', '=', 'iddocumento')
            ->where('oper_iddocumento_adj', $request->iddocumento)
            ->get();
---
select "iddocumento", "docu_idexma" as "expediente", "docu_origen", "docu_tipo", "tdo"."tdoc_descripcion", "docu_numero_doc", "docu_siglas_doc", "docu_fecha_doc", "docu_folios", "docu_asunto", "docu_iddependencia", "td"."depe_nombre" as "unidad", "td2"."depe_nombre" as "dependencia", "docu_firma", "docu_cargo", "docu_domic", "docu_ruc", "docu_dni", "docu_idtipodocumento", "docu_idusuario", "docu_proyectado", "docu_emailorigen", "docu_telef" from "tram_documento" inner join "tram_tipodocumento" as "tdo" on "docu_idtipodocumento" = "tdo"."idtdoc" inner join "admin" as "a" on "docu_idusuario" = "a"."id" inner join "tram_dependencia" as "td" on "docu_iddependencia" = "td"."iddependencia" left join "tram_dependencia" as "td2" on "td"."depe_depende" = "td2"."iddependencia" where "iddocumento" = '2' limit 1
select "iddocumento", "tdo"."tdoc_descripcion", "docu_numero_doc", "docu_siglas_doc", "docu_asunto", "docu_archivo" from "tram_documento" inner join "tram_tipodocumento" as "tdo" on "docu_idtipodocumento" = "tdo"."idtdoc" inner join "tram_operacion" on "oper_iddocumento" = "iddocumento" where "oper_iddocumento_adj" = '2'

            ->get();

        // la lista de las unidades
        $dependencias=DB::table('tram_dependencia')->whereNotNull('depe_sigla')->whereNotNull('depe_depende')->where('depe_estado',1)->orderBy('depe_nombre','asc')->get();
---
select * from "tram_dependencia" where "depe_sigla" is not null and "depe_depende" is not null and "depe_estado" = 1 order by "depe_nombre" asc