app/Http/Controllers/Tramites/Mesapartesvirtual.php

select "textmpv" from "mpvcomunicado" limit 1
---
    public function mensajempv()
    {
        $text=DB::table('mpvcomunicado')->value('textmpv');