app/Http/Controllers/Tramites/TramitesController.php

    public function actualizaciontramite(Request $request)
    {
        $datos=$request->all();
        $expediente=$request->fexpediente;
        $iddocumento=$request->iddocumento;

        $iduser=Auth::user()->id;
        $iddepe=DB::table('userofi')->where('id',$iduser)->value('depe_id');
        $formregistro=$request->ffrregistro;// tramite interno 1  externo 2

        $fderivaciones=$request->derivaciones;
        $archivo_rincipal=$request->file('files');// se obtiene archivo principal cargado
        $archivo_anexo=$request->file('anexosfiles');// se obtiene archivo anexos cargado

        $doc=Tram_documento::find($request->iddocumento);
---
select "depe_id" from "userofi" where "id" = 2 limit 1
select * from "tram_documento" where "tram_documento"."iddocumento" = '2' limit 1

    public function consulta_user($iddepe,$tipotram,$seldoc,$id)
    {
        //id del user 4295:wilmer ochoa alvarado de la tabla: admin
        $id=$id;//Auth::id();//4295;


        $idoficina=DB::table('userofi')->where(['id'=>$id,'depe_id'=>$iddepe])->value('depe_id');//2;// sale del id usuario
        $nombre=DB::table('userofi')->where(['id'=>$id,'depe_id'=>$iddepe])->value('adm_name');
        $apellidos=DB::table('userofi')->where(['id'=>$id,'depe_id'=>$iddepe])->value('adm_lastname');
        $nombreuser=$nombre.' '.$apellidos;// adm_name+adm_lastname
        $incialesuser=DB::table('userofi')->where(['id'=>$id,'depe_id'=>$iddepe])->value('adm_inicial');//'WOA';
        $cargouser=DB::table('userofi')->where(['id'=>$id,'depe_id'=>$iddepe])->value('adm_cargo');//'JEFE DE LA UNIDAD DE TRANSFORMACIÓN DIGITAL';


        // //CONSULTA PARA LA OFICINA EN CUESTION
        $nombreoficina=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_nombre');
        $siglaoficina=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_sigla');
        $representanteoficina=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_representante');
        $cargorepresnetante=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_cargo');
        // $depesuperior=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_superior');
        $logocabecera=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_imagen_header');
        $logopie=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_imagen_footer');

        $iddepe=DB::table('tram_dependencia')->where('iddependencia',$idoficina)->value('depe_depende');// para saber en qiedependecia esta

        $ciudad=DB::table('tram_dependencia')->where('iddependencia',$iddepe)->value('depe_ciudad');
        $direcciondepe=DB::table('tram_dependencia')->where('iddependencia',$iddepe)->value('depe_direccion');
        // $dat=json_decode($depesuperior);
        $idofisuperior=$iddepe;
        $nombreoficina_superior=DB::table('tram_dependencia')->where('iddependencia',$idofisuperior)->value('depe_nombre');

         // para el tipo de documento que se selecciona
        $anio=date('Y');
        $nombre_doc=DB::table('tram_tipodocumento')->where('idtdoc',$seldoc)->value('tdoc_descripcion');
---
select "depe_id" from "userofi" where ("id" = '2' and "depe_id" = '2') limit 1
select "adm_name" from "userofi" where ("id" = '2' and "depe_id" = '2') limit 1
select "adm_lastname" from "userofi" where ("id" = '2' and "depe_id" = '2') limit 1
select "adm_inicial" from "userofi" where ("id" = '2' and "depe_id" = '2') limit 1
select "adm_cargo" from "userofi" where ("id" = '2' and "depe_id" = '2') limit 1
select "depe_nombre" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_sigla" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_representante" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_cargo" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_imagen_header" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_imagen_footer" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_depende" from "tram_dependencia" where "iddependencia" = 2 limit 1
select "depe_ciudad" from "tram_dependencia" where "iddependencia" = 1 limit 1
select "depe_direccion" from "tram_dependencia" where "iddependencia" = 1 limit 1
select "depe_nombre" from "tram_dependencia" where "iddependencia" = 1 limit 1
select "tdoc_descripcion" from "tram_tipodocumento" where "idtdoc" = '0' limit 1

            $siglas_tramite=$anio.'-'.$siglaoficina;
            $firma_tramite=$representanteoficina;
            $cargo_tramite=$cargorepresnetante;
            $correlativo=DB::table('tram_tipodocumento_correl')->where(['tdco_idtipodocumento'=>$seldoc,'tdco_periodo'=>$anio,'tdco_iddependencia'=>$idoficina])->whereNull('tdco_idusuario')->orderBy('id','DESC')->limit(1)->value('tdco_numero');
---
select "tdco_numero" from "tram_tipodocumento_correl" where ("tdco_idtipodocumento" = '0' and "tdco_periodo" = '2024' and "tdco_iddependencia" = 2) and "tdco_idusuario" is null order by "id" desc limit 1

        $clavedoc=Str::random(6);//clave

        // la lista de las unidades
        $dependencias=DB::table('tram_dependencia')->whereNotNull('depe_sigla')->whereNotNull('depe_depende')->where('depe_estado',1)->orderBy('depe_nombre','asc')->get();
        $oficinadepe=DB::table('tram_dependencia')->whereNotNull('depe_sigla')->where(['depe_estado'=>1,'depe_depende'=>$iddepe])->orderBy('depe_nombre','asc')->get();
---
select * from "tram_dependencia" where "depe_sigla" is not null and "depe_depende" is not null and "depe_estado" = 1 order by "depe_nombre" asc
select * from "tram_dependencia" where "depe_sigla" is not null and ("depe_estado" = 1 and "depe_depende" = 1) order by "depe_nombre" asc

            'ddoc.depe_nombre as depe_nombre_destino',
            'docu_detalle',
            'ddest.depe_nombre as depe_nombre_origen',
            'docu_firma',
            'docu_cargo',
            'docu_asunto',
            'docu_digital',
            'u.adm_name as name_usuario',
            'u.adm_lastname as lastname_usuario',
            'o.created_at',
            'u1.adm_name as name_usuario_destino',
            'u1.adm_lastname as lastname_usuario_destino',
            'o.oper_usuid_d',
        ])
            ->with('docuArchivo')
            ->join('tram_operacion as o', 'iddocumento', '=', 'o.oper_iddocumento')
            ->join('tram_tipodocumento as td', 'docu_idtipodocumento', '=', 'td.idtdoc')
            ->leftJoin('tram_dependencia as ddoc', 'o.oper_depeid_d', '=', 'ddoc.iddependencia')
            ->leftJoin('tram_dependencia as ddest', 'docu_iddependencia', '=', 'ddest.iddependencia')
            ->leftJoin('admin AS u1', 'o.oper_usuid_d', '=', 'u1.id')
            ->join('admin AS u', 'o.oper_idusuario', '=', 'u.id')
            ->where($where)
            ->orderBy('o.idoperacion', 'asc')
            ->paginate(10);
---
select count(*) as aggregate from "tram_documento" inner join "tram_operacion" as "o" on "iddocumento" = "o"."oper_iddocumento" inner join "tram_tipodocumento" as "td" on "docu_idtipodocumento" = "td"."idtdoc" left join "tram_dependencia" as "ddoc" on "o"."oper_depeid_d" = "ddoc"."iddependencia" left join "tram_dependencia" as "ddest" on "docu_iddependencia" = "ddest"."iddependencia" left join "admin" as "u1" on "o"."oper_usuid_d" = "u1"."id" inner join "admin" as "u" on "o"."oper_idusuario" = "u"."id" where ("o"."oper_procesado" = 0 and "o"."oper_depeid_d" = 2 and "o"."oper_idtope" = 2 and "td"."idtdoc" is not null and "o"."oper_usuid_d" = '2')

                        ['td.idtdoc', '<>', env("TIPO_DOC_PAPELETA")],
                    ];

                    return Operacion::where($where)
                        ->join('tram_documento as d', 'oper_iddocumento', '=', 'd.iddocumento')
                        ->join('tram_tipodocumento as td', 'd.docu_idtipodocumento', '=', 'td.idtdoc')
                        ->leftJoin('tram_dependencia as ddoc', 'oper_depeid_d', '=', 'ddoc.iddependencia')
                        ->leftJoin('tram_dependencia as ddest', 'd.docu_iddependencia', '=', 'ddest.iddependencia')
                        ->leftJoin('admin AS u1', 'oper_usuid_d', '=', 'u1.id')
                        ->join('admin AS u', 'oper_idusuario', '=', 'u.id')
                        ->count();
---
select count(*) as aggregate from "tram_operacion" inner join "tram_documento" as "d" on "oper_iddocumento" = "d"."iddocumento" inner join "tram_tipodocumento" as "td" on "d"."docu_idtipodocumento" = "td"."idtdoc" left join "tram_dependencia" as "ddoc" on "oper_depeid_d" = "ddoc"."iddependencia" left join "tram_dependencia" as "ddest" on "d"."docu_iddependencia" = "ddest"."iddependencia" left join "admin" as "u1" on "oper_usuid_d" = "u1"."id" inner join "admin" as "u" on "oper_idusuario" = "u"."id" where ("oper_procesado" = 0 and "oper_depeid_d" = 2 and "oper_usuid_d" = 2 and "oper_idtope" = 2 and "td"."idtdoc" is not null)