app/Http/Controllers/Administrador/DepedendenciaController.php

select * from "tram_dependencia" where "depe_sigla" is null and "depe_tipo" = 2 order by "iddependencia" asc
---
    public function listardepeexternosinpg()
    {
        $datos=DB::table('tram_dependencia')->whereNull('depe_sigla')->where('depe_tipo',2)->orderBy('iddependencia','asc')->get();

select * from "tram_dependencia" order by "iddependencia" asc
---
    public function alldependencia()
    {
        $datos=DB::table('tram_dependencia')->orderBy('iddependencia','asc')->get();

select "tram_dependencia"."iddependencia", "tram_dependencia"."depe_nombre" from "tram_dependencia" inner join "tram_dependencia" as "td2" on "tram_dependencia"."iddependencia" = "td2"."depe_depende" where "tram_dependencia"."depe_tipo" = 0 and "td2"."depe_mesa_virtual" = 1 group by "tram_dependencia"."iddependencia", "tram_dependencia"."depe_nombre" order by "depe_nombre" asc
---
    public function dependenciaMesaPartesVirtual()
    {
        return Depedencia::select('tram_dependencia.iddependencia', 'tram_dependencia.depe_nombre')
            ->where('tram_dependencia.depe_tipo', '=', 0)
            ->where('td2.depe_mesa_virtual', '=', 1)
            ->join('tram_dependencia AS td2', 'tram_dependencia.iddependencia', '=', 'td2.depe_depende')
            ->orderBy('depe_nombre', 'asc')
            ->groupBy('tram_dependencia.iddependencia')
            ->groupBy('tram_dependencia.depe_nombre')
            ->get();

select "iddependencia", "depe_nombre", "depe_depende", "depe_representante", "depe_cargo", "depe_sigla" from "tram_dependencia" where "iddependencia" = 2 order by "depe_nombre" asc limit 1
---
    public function obtenerMiUnidadOrganica()
    {
        return Depedencia::select('iddependencia',
            'depe_nombre',
            'depe_depende',
            'depe_representante',
            'depe_cargo',
            'depe_sigla')
            ->where('iddependencia',Auth::user()->depe_id)
            ->orderBy('depe_nombre','ASC')
            ->first();