app/Http/Controllers/Administrador/UserController.php

select * from "usuario_oficinas" inner join "admin" on "usuario_oficinas"."iduser" = "admin"."id" where ("idunidad" = '2' and "estado" = 1)
select * from "usuario_oficinas" where ("idunidad" = '2' and "iduser" = 2 and "estado" = 1) limit 1
---
   public function usuariosunidad($depe)// lista de usuarios en la oficina o unidad organica
   {
        $id=Auth::user()->id;
        // $idsuser=Usuario_Oficina::join('','','','')
        $datos=Usuario_Oficina::join('admin','usuario_oficinas.iduser','=','admin.id')->where(['idunidad'=>$depe,'estado'=>1])->get();
        $busquedacargo=Usuario_Oficina::where(['idunidad'=>$depe,'iduser'=>$id,'estado'=>1])->first();

select * from "usuario_oficinas" inner join "admin" on "usuario_oficinas"."iduser" = "admin"."id" inner join "tram_dependencia" on "usuario_oficinas"."idunidad" = "tram_dependencia"."iddependencia" where ("admin"."id" = 2 and "estado" = 1)
---
   public function oficinasdelusuario()// lista de oficina a que pertenece el user
   {
        $id=Auth::user()->id;

        $datos=DB::table('usuario_oficinas')->join('admin','usuario_oficinas.iduser','=','admin.id')->join('tram_dependencia','usuario_oficinas.idunidad','=','tram_dependencia.iddependencia')->where(['admin.id'=>$id,'estado'=>1])->get();