app/Http/Controllers/ComunicacionInternaController.php

    public function activos()
    {
        $hoy = date('Y-m-d');
        $user=Auth::user()->id;
        $codunidad=User::where('id',$user)->value('depe_id');

        // la dependencia donde pertenece el user :sede central, gerctur,etc

        $dependencia=Depedencia::where('iddependencia',$codunidad)->value('depe_depende');
---
select "depe_depende" from "tram_dependencia" where "iddependencia" = 2 limit 1