app/Http/Controllers/FirmaperuController.php

    public function generatoken()
    {

        $reg=Firmaperu::count('token');
        if($reg==0)// cuando se crea por primera vez
        {

            $response=$this->devuelvetoken();

            $newtoken=new Firmaperu();
            $newtoken->token=$response;
            $dateTimeNow = Carbon::now();
            //This will add 24 hours from now
            $dateTimeNew = Carbon::now()->addHour(23);
            $newtoken->updated_at=$dateTimeNew;
            $newtoken->save();
            $token=$newtoken->token;// retornamos el token registrado
        }
        else{// cuando ya existe el token en la bd registrado

            $hoy = Carbon::today(); //Aquí se obtiene la fecha de hoy para hacer comprobaciones menores a 24 horas que dura el token
            // $fechareg=Firmaperu::value('updated_at');// fecha actualizada de la ultima actualizacion del token
            // comparamos que tonken no se pase
            $id=Firmaperu::limit(1)->value('id');
            $token=Firmaperu::whereDate('updated_at','>',$hoy)->value('token');
---
select count("token") as aggregate from "firmaperu"
insert into "firmaperu" ("token", "updated_at", "created_at") values ('{"cookies":{},"transferStats":{}}', '2024-01-23 10:15:11', '2024-01-22 11:15:11') returning "id"
select "id" from "firmaperu" limit 1
select "token" from "firmaperu" where "updated_at"::date > '2024-01-22' limit 1