app/Http/Controllers/Reniecsunat.php

    public function reniec(Request $request)
    {
        // $response = Http::get('https://api.apis.net.pe/v1/dni', [
        //     'numero' => $dni,
        // ]);
        $dni=$request->dni;
        if(strlen($dni)==8){

            // aqui buscamos si la persona se encuentra en bd, de no se asi recien hacemos busqueda en api
            $busca=Trampersona::where('dni',$dni)->get();
---
select * from "tram_persona" where "dni" = '42282733'

    public function sunat(Request $request)
    {
        // $response = Http::get('https://api.apis.net.pe/v1/ruc', [
        //     'numero' => $sunat,
        // ]);
        $sunat=$request->ruc;
        if(strlen($sunat)==11){

            $busca=Trampersonajuridica::where('ddp_numruc',$sunat)->get();
            if(count($busca)>0)
            {
                return $busca[0];
            }
            else{
                 // aqui buscamos si la persona se encuentra en bd, de no se asi recien hacemos busqueda en api
                $response = Http::get('http://app.regionhuanuco.gob.pe/soap_pruebas/datossunat.php', [
                    'cruc' => $sunat,
                ]);


                $datos= (array)json_decode($response);//json_decode($response);

                $persona = Trampersonajuridica::create($datos);
---
select * from "tram_persona_juridica" where "ddp_numruc" = '10422827337'
insert into "tram_persona_juridica" ("cod_dep", "cod_dist", "cod_prov", "ddp_ciiu", "ddp_doble", "ddp_estado", "ddp_fecact", "ddp_fecalt", "ddp_fecbaj", "ddp_flag22", "ddp_identi", "ddp_inter1", "ddp_lllttt", "ddp_mclase", "ddp_nombre", "ddp_nomvia", "ddp_nomzon", "ddp_numer1", "ddp_numreg", "ddp_numruc", "ddp_reacti", "ddp_refer1", "ddp_secuen", "ddp_tamano", "ddp_tipvia", "ddp_tipzon", "ddp_tpoemp", "ddp_ubigeo", "ddp_userna", "desc_ciiu", "desc_dep", "desc_dist", "desc_estado", "desc_flag22", "desc_identi", "desc_numreg", "desc_prov", "desc_tamano", "desc_tipvia", "desc_tipzon", "desc_tpoemp", "esActivo", "esHabido", "updated_at", "created_at") values ('10', '100102', '1001', '72202', '', '00', '04/01/2024', '23/07/2010', '', '00', '01', '-   ', '-      ', '', 'OCHOA ALVARADO WILMER                                                                               ', 'AGUILAR NALVARTE', 'AGUILAR NALVARTE', '-   ', '0193', '10422827337', '', 'ALTURA DE FONAVI II', '0', '', '11', '01', '01', '100102', '', 'CONSULTORES  PROG. Y SUMIN. INFORMATIC.', 'HUANUCO', 'AMARILIS                     ', 'ACTIVO                  ', 'HABIDO                            ', 'PERSONA NATURAL', 'O.Z.HUANUCO-MEPECO     ', 'HUANUCO', '', 'BLOCK', 'URBANIZACION', 'PERSONA NATURAL SIN NEGOCIO       ', '1', '1', '2024-01-22 11:46:16', '2024-01-22 11:46:16') returning "id"