app/Http/Controllers/Tipodocumento/TipodocumentoController.php

    public function index()
    {
        $datos=DB::table('tram_tipodocumento')->orderBy('tdoc_descripcion','asc')->get();
---
select * from "tram_tipodocumento" order by "tdoc_descripcion" asc

    public function mpv()
    {
        return TipoDocumento::where('tdoc_mpv',1)
            ->orderBy('tdoc_descripcion','asc')
            ->get();
---
select * from "tram_tipodocumento" where "tdoc_mpv" = 1 order by "tdoc_descripcion" asc